Autodesk.Revit.DB.Structure.Rebar.SetStaggerOffset(System.Double,System.Int32)
Sets the stagger offset at the specified end
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.GetStaggerOffset(System.Int32)
Gets the stagger offset at the specified end
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.SetSpliceInformation(Autodesk.Revit.DB.Structure.RebarSplice,System.Int32)
Sets the splice information at the indicated bar end.
spliceInfo:
The splice information.
barEnd:
The bar end that holds the splice information.
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.RemoveSplice(System.Int32)
Removes the splice relation at the specified end and all the Rebar Constraints involved in splice.
barEnd:
The end where the splice is to be removed - 0 for start, 1 for end.
Throws Autodesk.Revit.Exceptions.ArgumentException:
There is no splice at the specified end.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barEnd must be 0 or 1.
Since:
2025

Autodesk.Revit.DB.Structure.Rebar.GetSpliceStaggerLength(System.Int32)
Gets the stagger length that is used for the specified end - 0 for start, 1 for end.
barEnd:
The end where the splice is - 0 for start, 1 for end.
Returns:
Returns the stagger length that is used for the specified end - 0 for start, 1 for end.
Throws Autodesk.Revit.Exceptions.ArgumentException:
There is no splice at the specified end.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barEnd must be 0 or 1.
Since:
2025

Autodesk.Revit.DB.Structure.Rebar.GetLapLength(System.Int32)
Gets the lap length that is used for the specified end - 0 for start, 1 for end.
barEnd:
The end where the splice is - 0 for start, 1 for end.
Returns:
Returns the lap length that is used for the specified end - 0 for start, 1 for end.
Throws Autodesk.Revit.Exceptions.ArgumentException:
There is no splice at the specified end.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barEnd must be 0 or 1.
Since:
2025

Autodesk.Revit.DB.Structure.Rebar.GetRebarSplice(System.Int32)
Gets the rebar splice at the specified bar end - 0 for start, 1 for end.
Remarks:
In order to splice a rebar or unify existing spliced rebars there are utility functions in Autodesk.Revit.DB.Structure.RebarSpliceUtils class.
barEnd:
The bar end for which the rebar splice is needed - 0 for start, 1 for end.
Returns:
Returns the rebar splice at the specified bar end - 0 for start, 1 for end.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barEnd must be 0 or 1.
Since:
2025

Autodesk.Revit.DB.Structure.Rebar.MoveBarInSet(System.Int32,Autodesk.Revit.DB.Transform)
This method applies the transformation matrix to the rebar bar at the desired position in the rebar set.
If the bar was already moved, the method will concatenate the transformation matrix with the existing movement.
barPositionIndex:
The bar index of the rebar to apply the transformation.
moveTransform:
The transformation matrix to apply to the specified rebar bar.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].
-or-
moveTransform is not conformal.
Since:
2022

Autodesk.Revit.DB.Structure.Rebar.GetParameterValueAtIndex(Autodesk.Revit.DB.ElementId,System.Int32)
Get the parameter value for a bar at the specified index.
Remarks:
For rebar sets which don't have varying length bars the returned ParameterValue is the same no matter the index.
For rebar sets which have varying length bars the returned ParameterValue is evaluated at the given index.
paramId:
The parameter Id.
barPositionIndex:
The bar index in the rebar distribution. Accepts only values between 0 and NumberOfBarPositions-1.
Returns:
The ParameterValue for given parameterId and barPositionIndex.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].
Since:
2017

Autodesk.Revit.DB.Structure.Rebar.GetCenterlineCurves(System.Boolean,System.Boolean,System.Boolean,Autodesk.Revit.DB.Structure.MultiplanarOption,System.Int32)
A chain of curves representing the centerline of the rebar.
Remarks:
This method will return the centerline curves for bar at barPositionIndex even if this bar isn't included.
adjustForSelfIntersection:
If the curves overlap, as in a planar stirrup, this parameter controls
whether they should be adjusted to avoid intersection (as in fine views),
or kept in a single plane for simplicity (as in coarse views).
suppressHooks:
Identifies if the chain will include hooks curves.
suppressBendRadius:
Identifies if the connected chain will include unfilleted curves.
multiplanarOption:
If the Rebar is a multi-planar shape, this parameter controls whether to generate only
the curves in the primary plane (IncludeOnlyPlanarCurves), or to generate all curves,
(IncludeAllMultiplanarCurves) including the out-of-plane connector segments as well as
multi-planar copies of the primary plane curves.
This argument is ignored for planar shapes.
barPositionIndex:
An index between 0 and (NumberOfBarPositions-1).
Use the barPositionIndex to obtain all the curves at a specific index in the distribution.
You can use GetNumberOfBarPositions() to verify if a specific rebar has more than one bar positions.
This is useful for rebar sets that have varying length bars. In this case you can retrieve the
centerline curve geometry of that particular bar, by passing the appropriate index
If the rebar set don't have varying bars, the form of the bars does not vary from one index to another.
Returns:
The centerline curves or empty array if the curves cannot be computed because
the parameters values are inconsistent
with the constraints of the RebarShape definition.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].
-or-
A value passed for an enumeration argument is not a member of that enumeration
Since:
2017

Autodesk.Revit.DB.Structure.Rebar.CreateFreeForm(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.RebarBarType,Autodesk.Revit.DB.Element,System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop},Autodesk.Revit.DB.Structure.RebarFreeFormValidationResult@)
Creates a free form rebar that will be unconstrained. Constraints can't be added later to this rebar.
Remarks:
The created rebar will have curves.Count bars. The layout will be Single if curves.Count is 1, otherwise will be Fixed Number and will not be changeable.
Setting a new list of curves will only change the number of bars in set.
This function can fail due to following reasons: The array of CurveLoops is empty.At least one CurveLoop is empty.At least one CurveLoop contains an unbounded curve.A rebar constructed from curves can't be bent according to the bending radius.
doc:
A document.
barType:
A RebarBarType element that defines bar diameter, bend radius and material of the rebar.
host:
The element to which the rebar belongs. The element must support rebar hosting.
curves:
Each curve loop represents a bar in the set.
error:
Will be Success(0) if everything is ok, otherwise the failure reason.
Returns:
The newly created free form Rebar Instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
host is not a valid rebar host.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2018

Autodesk.Revit.DB.Structure.Rebar.CreateFreeForm(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.RebarBarType,Autodesk.Revit.DB.Element,System.Collections.Generic.IList{System.Collections.Generic.IList{Autodesk.Revit.DB.Curve}},Autodesk.Revit.DB.Structure.RebarFreeFormValidationResult@)
Creates a free form rebar that will be unconstrained. Constraints can't be added later to this rebar.
Remarks:
The created rebar will have curves.Count bars. The layout will be Single if curves.Count is 1, otherwise will be Fixed Number and will not be changeable.
Setting a new list of curves will only change the number of bars in set.
This function can fail due to following reasons: One or more of the input curves was null.One or more of the input curves was unbounded.Curves doesn't form a valid curve loop, it forms 0, 2 or more curve loops.A rebar constructed from curves can't be bent according to the bending radius.
doc:
A document.
barType:
A RebarBarType element that defines bar diameter, bend radius and material of the rebar.
host:
The element to which the rebar belongs. The element must support rebar hosting.
curves:
Each array of curves represent a bar in the set.
error:
Will be Success if everything is ok, otherwise the failure reason.
Returns:
The newly created free form Rebar Instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
host is not a valid rebar host.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2018

Autodesk.Revit.DB.Structure.Rebar.CreateFreeForm(Autodesk.Revit.DB.Document,System.Guid,Autodesk.Revit.DB.Structure.RebarBarType,Autodesk.Revit.DB.Element)
Creates a free form rebar that can have constraints.
Remarks:
For this type of Free Form Rebar, the layout can be changed. The server identified by serverGUID will have the responsibility to create the curves for the specified layout.
It requires a server GUID which will have the responsibility to define bar handles(which will be constrained) and to do the calculation of the curves.
See Autodesk.Revit.DB.Structure.IRebarUpdateServer for more details.
doc:
A Document.
serverGUID:
The API server GUID.
Should be the same that the function GetServerId() from class derived from Autodesk.Revit.DB.Structure.IRebarUpdateServer returns.
This server has the responsibility to calculate the bars of Rebar.
barType:
A RebarBarType element that defines bar diameter, bend radius and material of the rebar.
host:
The element to which the rebar belongs. The element must support rebar hosting.
Returns:
The newly created free form Rebar Instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
host is not a valid rebar host.
-or-
The server with serverGUID was not registered for RebarUpdateService.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.Structure.Rebar.HasVariableLengthBars
Identifies if a set has varying length bars or not.
Remarks:
This function internally compares the bar lengths, so to have an accurate result the document should be regenerated before calling it.
Since:
2025

Autodesk.Revit.DB.Structure.Rebar.CanHaveVaryingLengthBars
Identifies if a set can have varying length bars or not.
Remarks:
This property is true if:
For free form rebar this will always be true.This is a free form rebar.This is a shape driven rebar for which the property Autodesk.Revit.DB.Structure.RebarShapeDrivenAccessor.UseRebarConstraintsToProduceVaryingBars is true.This is a shape driven rebar which has a splice stagger length different then 0 at least at one of the bar's ends.
Otherwise, is false.
Since:
2025

Autodesk.Revit.DB.Structure.Rebar.DistributionType
The type of rebar distribution(also known as Rebar Set Type).
Remarks:
The possible values of this property are:
UniformVaryingLength
For a uniform distribution type: all bars' parameters are the same as the first bar in set.
For a varying length distribution type: bars parameters can vary(primarily in length)
taking in consideration the constraints of the first bar in set.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2017